---
type: VoltageType
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 6
tags: [revit-api, class]
---

# VoltageType

`Autodesk.Revit.DB.Electrical.VoltageType` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | SetVoltageValue | — | `public void SetVoltageValue ( double actualValue , double minValue , double maxValue )` |
| Property | ActualValue | — | `public double ActualValue { get ; }` |
| Property | IsInUse | — | `public bool IsInUse { get ; }` |
| Property | MaxValue | — | `public double MaxValue { get ; }` |
| Property | MinValue | — | `public double MinValue { get ; }` |
| Property | Parameter | — | `` |